# messages.py

messages = {
    "welcome_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "✨ Привет! \nТы готов познакомится новыми людьми? Если да, для начала ответь пожалуйста "
                "на два <b>формальных вопроса.</b>",
        "button_text": "Регистрация"
    },
    "age_request_message": {
        "text": "Перед тем как начать, давай создадим твой профиль. "
                "Напиши, сколько тебе лет 🎂"

    },
    "age_input_message": {
        "error_text_age_under_16": "Извини. Но чат-ботом могут пользоваться только лица старше 16 лет.",
        "error_text_invalid_data_type": "Пожалуйста, введите ваш возраст цифрами.",
        "text_consent_messages": "🧐 Для работы с чат-ботом требуется твое <b>разрешение</b> на использование ссылки "
                                 "на ваш Telegram профиль. Вы согласны?",
        "button_text_yes": "Да 👍",
        "button_text_no": "Нет 👎"
    },
    "consent_yes_message": {
        "text": "Хорошо, с формальностями закончили, давай продолжим создавать твой профиль 😃\nКак тебя зовут?"
    },
    "consent_no_message": {
        "text": "Нам жаль, если передумаете, будем ждать вас 😔"
    },
    "ask_gender_message": {
        "text": "Выбери пол",
        "button_text_male": "Мужчина",
        "button_text_female": "Женщина"
    },
    "ask_city_message": {
        "text": "В каком городе ты живешь?"
    },
    "ask_descriptions_message": {
        "text": "Расскажи немного о себе"
    },
    "ask_status_message": {
        "text": "Какую цель общения вы ищете?",
        "button_text_status_1": "👋 Найти друзей",
        "button_text_status_2": "💕 Найти вторую половинку",
        "button_text_status_3": "💌 Просто пообщаться"
    },
    "ask_photo_message": {
        "text": "Теперь загрузите ваше фото"
    },
    "photo_and_final_register_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "🚼 Ваш профиль создан! Теперь вы можете начать пользоваться чат-ботом",
        "button_text": "Супер, давай же начнем!"
    },
    "profile_edit_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "Этот функционал еще не разработан. Приходите сюда позже :)",
        "button_text_back": "Назад",
        "button_text_edit_name": "Имя",
        "text2": "<b>Данные успешной обновлены!</b>"
    },
    "profile_delete_confirm_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "Вы точно хотите удалить свой профиль? Это действие отменить нельзя",
        "button_text_confirm_delete": "Да, удалить",
        "button_text_cancel": "Нет, вернуться назад"
    },
    "profile_deleted_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "Ваш профиль удален. \nЖалко, что вы ушли. Если передумаете, мы всегда будем рады вас видеть вновь."
    },
    "main_screen_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "Добро пожаловать на главный экран, тут вы сможете начать поиск спутников, узнать о проекте и "
                "настроить свой профиль.",
        "button_text_start_searching": "🔍 Начать поиск 🔍",
        "button_text_profile": "🪪 Мой профиль",
        "button_text_about": "🗂 О Проекте"
    },
    "about_project_message": {
        "image_url": "https://telegra.ph/file/ad7079ce8110af0f35771.png",
        "text": "Здесь описание проекта.",
        "button_text_back": "Назад"
    }
}
